In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('database.csv')

In [4]:
df_cleaned = df.dropna()

In [5]:
df_filled = df.fillna(df.select_dtypes(include=np.number).mean()) # Select only numeric columns for calculating the mean

In [6]:
df_filled = df.fillna(df.select_dtypes(include=np.number).mean()) # Select only numeric columns for calculating the mean

In [7]:
df_filled_mode = df.apply(lambda x: x.fillna(x.mode()[0]) if x.dtype == 'O' else x)

In [8]:
Q1 = df.select_dtypes(include=np.number).quantile(0.25) # Select numeric columns for quantile calculations
Q3 = df.select_dtypes(include=np.number).quantile(0.75) # Select numeric columns for quantile calculations
IQR = Q3 - Q1

In [9]:
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

In [10]:
outliers = ((df.select_dtypes(include=np.number) < lower_bound) | (df.select_dtypes(include=np.number) > upper_bound))

In [11]:
df_no_outliers = df[~((df.select_dtypes(include=np.number) < lower_bound) | (df.select_dtypes(include=np.number) > upper_bound)).any(axis=1)]

In [12]:
df_capped = df.copy()
numeric_df = df.select_dtypes(include=np.number) # Select numeric columns for comparison

for col in numeric_df.columns:
    df_capped.loc[numeric_df[col] < lower_bound[col], col] = lower_bound[col]
    df_capped.loc[numeric_df[col] > upper_bound[col], col] = upper_bound[col]

In [13]:
df_imputed_outliers = df.copy()
df_imputed_outliers[outliers] = np.nan

In [14]:
numeric_df = df.select_dtypes(include=np.number)
df_imputed_outliers = df_imputed_outliers.fillna(numeric_df.mean())

In [15]:
print("Original DataFrame:\n", df)
print("DataFrame after handling missing values and outliers:\n", df_imputed_outliers)

Original DataFrame:
      Name   Age  Height  Weight   Salary         City
0    John  28.0   175.0    70.0  50000.0     New York
1    Anna  24.0   160.0    55.0  62000.0  Los Angeles
2   Peter  35.0   180.0    85.0  75000.0      Chicago
3   Linda   NaN   165.0     NaN  48000.0      Houston
4   James  29.0     NaN    68.0  53000.0      Phoenix
5     Tom  45.0   182.0    90.0  90000.0      Seattle
6    Sara   NaN   168.0    60.0      NaN       Boston
7  George  32.0   177.0    85.0  70000.0        Miami
8     Amy  22.0     NaN    55.0  61000.0       Dallas
9    Ryan  33.0   180.0    75.0  80000.0       Denver
DataFrame after handling missing values and outliers:
      Name   Age   Height     Weight        Salary         City
0    John  28.0  175.000  70.000000  50000.000000     New York
1    Anna  24.0  160.000  55.000000  62000.000000  Los Angeles
2   Peter  35.0  180.000  85.000000  75000.000000      Chicago
3   Linda  31.0  165.000  71.444444  48000.000000      Houston
4   James  29.0  173.375  68.000000  53000.000000      Phoenix
5     Tom  31.0  182.000  90.000000  90000.000000      Seattle
6    Sara  31.0  168.000  60.000000  65444.444444       Boston
7  George  32.0  177.000  85.000000  70000.000000        Miami
8     Amy  22.0  173.375  55.000000  61000.000000       Dallas
9    Ryan  33.0  180.000  75.000000  80000.000000       Denver